OpenFOAM-2.3.1/tutorials/combustion/fireFoam/les/oppositeBurningPanels/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=`getApplication`

runApplication blockMesh

runApplication topoSet -dict system/cRefine.topoSetDict
runApplication refineMesh -overwrite -dict system/refineMeshDict

rm log.topoSet
runApplication topoSet -dict system/f.topoSetDict

# create the pyrolysis region.
runApplication extrudeToRegionMesh -overwrite


rm log.topoSet
runApplication topoSet -dict system/fBurner.topoSetDict

runApplication createPatch -overwrite

decomposePar -force > log.decomposePar.log 2>&1

decomposePar -region panelRegion > log.decomposeParPanelRegion.log 2>&1

runParallel `getApplication` 6

paraFoam -touch
paraFoam -touch -region panelRegion


# ----------------------------------------------------------------- end-of-file
